redux-todos/app/controllers/api/todos_controller.rb

  def index
    @todos = Todo.includes(:steps).all
    # for each todo the key of steps:=== all the steps
    todos = @todos.as_json
    arr = []
    todos.map.with_index do |todo, idx|
      todo[:steps] = @todos[idx].steps
      arr << todo
---
SELECT "steps".* FROM "steps" WHERE "steps"."todo_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["todo_id", 37], ["todo_id", 38], ["todo_id", 39], ["todo_id", 40], ["todo_id", 41], ["todo_id", 42], ["todo_id", 43], ["todo_id", 44], ["todo_id", 45], ["todo_id", 46]]
SELECT "todos".* FROM "todos"
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["body", "123"], ["done", false], ["created_at", "2018-12-04 22:23:34.095990"], ["updated_at", "2018-12-04 22:23:34.095990"]]

  def show
    render json: Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]

  def update
    @todo = Todo.find(params[:id])
    if @todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", true], ["updated_at", "2018-12-05 00:13:26.291495"], ["id", 26]]

  def destroy
    @todo = Todo.find(params[:id])
    print "this is the deleted todo => "
    puts @todo
    @todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 35]]